Documents/ВводПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ЗаданияНаСнятиеПоказанийПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраничнаяДатаСъема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходЧерезНоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПериодРасчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрупповоеЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотребителяУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНормПотребления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияНормПотребления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияРасчетнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеПрибораУчетаДляЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУсловиеРасчетаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДополнительнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйМетод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаПоСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаПоСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаПоСредней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьЭнергоемкость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУХолоднаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУГарячаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоКубов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслугиПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВводПоказанийПриборовУчета/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Услуга КАК Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент КАК Коэффициент,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Разница * ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент КАК Значение
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки,
		|	УслугиСоставныеУслуги.Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Разница * ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент * УслугиСоставныеУслуги.Коэффициент
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.СоставныеУслуги КАК УслугиСоставныеУслуги
		|		ПО ВременнаяТаблицаПоказанияПриборовУчета.Услуга = УслугиСоставныеУслуги.Ссылка
		|ГДЕ
		|	УслугиСоставныеУслуги.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетПоказанийПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетПоказанийПриборовУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период КАК Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Показание КАК Значение,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Отключен КАК Отключен
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|ГДЕ
		|	ВременнаяТаблицаПоказанияПриборовУчета.Отключен = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредства()

Процедура СформироватьТаблицуЗаданийНаСнятиеПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВременнаяТаблицаПоказанияПриборовУчета.Исполнитель,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.Здание,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектЛицевогоСчета,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.ГраничнаяДатаСъема,
                   |	&Период
                   |ИЗ
                   |	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета";
				   
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаданияНаСнятиеПоказаний", РезультатЗапроса.Выгрузить());

	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВводПоказанийПриборовУчетаОсновная.Услуга,
		 |	ВводПоказанийПриборовУчетаОсновная.ПриборУчета,
		 |	ВводПоказанийПриборовУчетаОсновная.ОбъектУстановки КАК ОбъектУстановки,
		 |	ВводПоказанийПриборовУчетаОсновная.ВидТарифа,
		 |	КОНЕЦПЕРИОДА(ВводПоказанийПриборовУчетаОсновная.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	ВводПоказанийПриборовУчетаОсновная.Показание,
		 |	ВводПоказанийПриборовУчетаОсновная.ПоказаниеПредыдущее,
		 |	ВводПоказанийПриборовУчетаОсновная.Разница,
		 |	ВводПоказанийПриборовУчетаОсновная.Коэффициент,
		 |	ВводПоказанийПриборовУчетаОсновная.Отключен,
		 |	ВводПоказанийПриборовУчетаОсновная.Ссылка.ГраничнаяДатаСъема,
		 |	ВводПоказанийПриборовУчетаОсновная.Ссылка.Исполнитель,
		 |	ВводПоказанийПриборовУчетаОсновная.ОбъектЛицевогоСчета,
		 |	ВводПоказанийПриборовУчетаОсновная.Ссылка.Здание
		 |ПОМЕСТИТЬ ВременнаяТаблицаПоказанияПриборовУчета
		 |ИЗ
		 |	Документ.ВводПоказанийПриборовУчета.Основная КАК ВводПоказанийПриборовУчетаОсновная
		 |ГДЕ
		 |	ВводПоказанийПриборовУчетаОсновная.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказанийПриборовУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуЗаданийНаСнятиеПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
КонецПроцедуры

// Выполняет контроль повторного начисления.
//
Процедура ВыполнитьКонтрольПовторногоНачисления(ДокументСсылкаВводПоказанийПриборовУчета, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетПоказанийПриборовУчетаИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				(ОбъектУстановки, ПриборУчета, Услуга, ВидТарифа) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки КАК ОбъектУстановки,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета КАК ПриборУчета,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа КАК ВидТарифа
		|					ИЗ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение)) КАК РасчетПоказанийПриборовУчетаОбороты
		|		ПО ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки = РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета = РасчетПоказанийПриборовУчетаОбороты.ПриборУчета
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга = РасчетПоказанийПриборовУчетаОбороты.Услуга
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа = РасчетПоказанийПриборовУчетаОбороты.ВидТарифа
		|ГДЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор <> &Ссылка");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказанийПриборовУчета);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДокументСсылкаВводПоказанийПриборовУчета.ПериодНачисления));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДокументСсылкаВводПоказанийПриборовУчета.ПериодНачисления));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектВводПоказанийПриборовУчета = ДокументСсылкаВводПоказанийПриборовУчета.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокументОбъектВводПоказанийПриборовУчета, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// Функция проверяет, проведен документ или нет, и вызывает процедуру печати
// документа.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВводПоказанийПриборовУчета";
	
	ПервыйДокумент = Истина;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Если ИмяМакета = "БланкПоказанийСчетчиков" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВводПоказанийПриборовУчета.Ссылка,
			|	ВводПоказанийПриборовУчета.Номер,
			|	ВводПоказанийПриборовУчета.Дата,
			|	ВводПоказанийПриборовУчета.Организация,
			|	ВводПоказанийПриборовУчета.Основная.(
			|		НомерСтроки,
			|		ОбъектУстановки КАК ОбъектУстановки,
			|		ПриборУчета,
			|		ПоказаниеПредыдущее КАК ПоказаниеПредыдущее,
			|		Показание КАК Показание,
			|		ОбъектУстановки.ОбъектЛицевогоСчета КАК Помещение,
			|		ОбъектУстановки.Владелец КАК Адрес
			|	),
			|	ВводПоказанийПриборовУчета.Услуга,
			|	ВводПоказанийПриборовУчета.Здание
			|ИЗ
			|	Документ.ВводПоказанийПриборовУчета КАК ВводПоказанийПриборовУчета
			|ГДЕ
			|	ВводПоказанийПриборовУчета.Ссылка = &ТекущийДокумент";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БланкПоказанийСчетчиков";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ВводПоказанийПриборовУчета.ПФ_MXL_БланкПоказанийСчетчиков");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьТелоТаблицы = Макет.ПолучитьОбласть("ТелоТаблицы");
			Подвал = Макет.ПолучитьОбласть("Подвал");
			
			ТабличныйДокумент.Очистить();
			
			ВставлятьРазделительСтраниц = Ложь;
			Пока Выборка.Следующий() Цикл
				
				Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер, Истина, Истина);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ТекущийДокумент.Ссылка);

				ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru='Бланк показаний счетчиков № ';uk='Бланк свідчень лічильників №'", КодЯзыкаПечать)
				+ Номер
				+ НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать)
				+ Формат(Выборка.Дата, "Л="+КодЯзыкаПечать+"; ДЛФ=DD");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВставлятьРазделительСтраниц Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				Шапка.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());
				
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				ВыборкаТаблица = Выборка.Основная.Выгрузить();
				ВыборкаТаблица.Сортировать("ОбъектУстановки Возр");
				//Пока ВыборкаТаблица.Следующий() Цикл
				Для Каждого Строка Из ВыборкаТаблица Цикл
					ОбластьТелоТаблицы.Параметры.Заполнить(Строка);//(ВыборкаТаблица);
					ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);//, ВыборкаТаблица.Уровень());
				КонецЦикла;
								
				Подвал.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(Подвал);
				
				ВставлятьРазделительСтраниц = Истина;
			КонецЦикла;			
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БланкПоказанийСчетчиков") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БланкПоказанийСчетчиков", "Бланк показаний счетчиков", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БланкПоказанийСчетчиков"));
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
	ДанныеПоВсемОбъектам,
	Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
	ОписаниеОбластей,
	ТипыМакетов,
	ДвоичныеДанныеМакетов));
	
КонецФункции
